# SetRoofAttributes

## Description
Function SetRoofAttributes sets the definition attributes of a roof object in a Vectorworks document. &lt;BR&gt;
&lt;BR&gt;
&lt;I&gt;Table - Roof Miter Styles&lt;/I&gt;&lt;P&gt;
&lt;CENTER&gt;
&lt;TABLE BORDER=0 ALIGN=CENTER CELLSPACING=1 CELLPADDING=3&gt;
  &lt;TR&gt;
	&lt;TH ALIGN=CENTER BGCOLOR=#000000&gt;&lt;FONT COLOR=#FFFFFF&gt;Miter Style&lt;/FONT&gt;&lt;/TH&gt;
	&lt;TH ALIGN=CENTER BGCOLOR=#000000&gt;&lt;FONT COLOR=#FFFFFF&gt;Constant&lt;/FONT&gt;&lt;/TH&gt;
  &lt;/TR&gt;
  &lt;TR&gt;
	&lt;TD ALIGN=CENTER BGCOLOR=#CCCCCC&gt;Vertical&lt;/TD&gt;
	&lt;TD ALIGN=CENTER BGCOLOR=#CCCCFF&gt;1&lt;/TD&gt;
  &lt;/TR&gt;
  &lt;TR&gt;
	&lt;TD ALIGN=CENTER BGCOLOR=#CCCCCC&gt;Horizontal&lt;/TD&gt;
	&lt;TD ALIGN=CENTER BGCOLOR=#CCCCFF&gt;2&lt;/TD&gt;
  &lt;/TR&gt;
  &lt;TR&gt;
	&lt;TD ALIGN=CENTER BGCOLOR=#CCCCCC&gt;Double&lt;/TD&gt;
	&lt;TD ALIGN=CENTER BGCOLOR=#CCCCFF&gt;&lt;p&gt;3&lt;/p&gt;&lt;/TD&gt;
  &lt;TR&gt;
	&lt;TD ALIGN=CENTER BGCOLOR=#CCCCCC&gt;Square&lt;/TD&gt;
	&lt;TD ALIGN=CENTER BGCOLOR=#CCCCFF&gt;&lt;p&gt;4&lt;/p&gt;&lt;/TD&gt;
  &lt;/TR&gt;
&lt;/TABLE&gt;
&lt;/CENTER&gt;

```pascal
PROCEDURE SetRoofAttributes(
				roofObject           : HANDLE;
				genGableWall         : BOOLEAN;
				bearingInsetDistance : REAL (Coordinate);
				roofThickDistance    : REAL (Coordinate);
				miterType            : INTEGER;
				vertMiterDistance    : REAL (Coordinate));
```

```python

def vs.SetRoofAttributes(roofObject, genGableWall, bearingInsetDistance, roofThickDistance, miterType, vertMiterDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roofObject|HANDLE|Handle to roof .|
|genGableWall|BOOLEAN|Sets gable roof generation mode.|
|bearingInsetDistance|REAL (Coordinate)|Sets bearing inset distance.|
|roofThickDistance|REAL (Coordinate)|Sets roof thickness.|
|miterType|INTEGER|Sets miter style.|
|vertMiterDistance|REAL (Coordinate)|Specifies vertical miter dimension.|

## Remarks
genGableWall: Set to true to have a wall created at gable ends of the roof.  Otherwise no object will be inserted.<BR>
bearingInset  is where the weight of the roof rests on the wall.  This is an inset from the defining edge of the roof plan.<BR>
miterType:  Specify 1 for a vertical miter, 2 for horizontal miter, 3 for a double miter cut, and 4 for a square end miter cut.  vertMiter: This is used only with the double miter type; it specifies the vertical length of the miter cut.

## Examples
```pascal
PROCEDURE Example;

VAR

	thickness :REAL;

	str	:STRING;

PROCEDURE SetIt(h :HANDLE);

BEGIN

	IF GetObjectVariableInt(h, 172) = 1 THEN

		SetObjectVariableReal(h, 170, thickness * 25.4);

END;

PROCEDURE FindRoofFaces(h :HANDLE);

VAR

	temp_h :HANDLE;

	roofObject :HANDLE;

	genGableWall :BOOLEAN;

	bearingInsetDistance, roofThickDistance :REAL;

	miterType :INTEGER;

	vertMiterDistance :REAL;

BEGIN

	IF GetType(h) = 71 THEN SetIt(h) ELSE

	IF GetRoofAttributes(h, genGableWall, bearingInsetDistance, roofThickDistance, miterType, vertMiterDistance) THEN

		SetRoofAttributes(h, genGableWall, bearingInsetDistance, thickness, miterType, vertMiterDistance);

END;

BEGIN

	thickness := RealDialog('Enter desired thickness', '10');

	str := Concat('((T=71) | (T=83)) &amp; (L=''', GetLName(ActLayer), ''')');

	ForEachObject(FindRoofFaces, str);

END;

RUN(Example);

```

## Version
Availability: from VectorWorks8.0
## Category
* Objects - Roofs